benchmarks/playwright/mcpeval.yaml
$schema: ./schema/mcpeval.config.schema.json
name: Microsoft Playwright Server Test Suite
mcp:
  servers:
    playwright:
      transport: stdio
      command: npx
      args:
      - '@playwright/mcp@latest'
provider: anthropic
model: claude-sonnet-4-20250514
default_agent: playwright_agent
agents:
  definitions:
  - name: playwright_agent
    instruction: 'you are a playwright agent that can interact with web pages, fill
      out forms, and navigate websites.

      '
    server_names:
    - playwright
    max_iterations: 5
judge:
  min_score: 0.8
  max_tokens: 2000
  system_prompt: 'You are an expert evaluator of web automation tasks.

    Consider accuracy, completeness, error handling, and efficiency.

    '
  provider: anthropic
  model: claude-sonnet-4-20250514
metrics:
  collect:
  - response_time
  - total_duration
  - iteration_count
  - tool_coverage
  - tool_success_rate
  - unique_tools_used
  - unique_servers_used
  - parallel_tool_calls
  - max_concurrent_operations
  - token_usage
  - input_tokens
  - output_tokens
  - cost_estimate
  - llm_time
  - tool_time
  - reasoning_time
  - idle_time
  - error_count
  - error_rate
  - success_rate
  - path_efficiency_score
  - content_extraction_quality
  - error_recovery
reporting:
  formats:
  - json
  - markdown
  output_dir: ./test-reports
  include_traces: true
execution:
  max_concurrency: 3
  timeout_seconds: 120
  retry_failed: false